Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
        );
    }
}

void printAllLedsTime() {
    Serial.printf_P(PSTR("%s\n"), "Отображение текущих настроек всех прожекторов");
    printLEDTime(ONE);
    printLEDTime(TWO);
    printLEDTime(THREE);
    printLEDTime(FOUR);
    printLEDTime(FIVE);
    printLEDTime(SIX);
}
//Загрузка времени включения/выключения прожектора
void setLEDTime(ledPosition position) {
    uint8_t ledsCount = (sizeof(leds) / sizeof(*leds));
    String ledPath;
    uint8_t i;
    bool found = false;
    for (size_t k = 0; k < ledsCount; k++) {
        if (leds[k].position == position) {
            ledPath = leds[k].name;
            i = k;
            found = true;
            k = ledsCount;
        }
    }
    if (found) {
        if (Firebase.getJSON(data, pathLight + ledPath)) {
            if ((data.dataType() == "json")) {
                String json = data.jsonString();
                StaticJsonDocument<180> doc;
                std::vector<String> vectorString;
                DeserializationError err = deserializeJson(doc, json);
                if (err) {
                    Serial.printf_P(PSTR("Ошибка десериализации: %s\n"), err.c_str());
                } else {
                    leds[i].led.enabled = doc["enabled"];
                    leds[i].led.pin = doc["pin"];
                    leds[i].led.currentState = doc["state"];

                    vectorString.clear();
                    vectorString = splitVector(doc["off"]);
                    leds[i].led.HOff = vectorString[0].toInt();
                    leds[i].led.MOff = vectorString[1].toInt();

                    vectorString.clear();
                    vectorString = splitVector(doc["on"]);
                    leds[i].led.HOn = vectorString[0].toInt();
                    leds[i].led.MOn = vectorString[1].toInt();

                    leds[i].led.off = Alarm.alarmRepeat(leds[i].led.HOff, leds[i].led.MOff, 0, ledOffHandler, leds[i]);
                    leds[i].led.on = Alarm.alarmRepeat(leds[i].led.HOn, leds[i].led.MOn, 0, ledOnHandler, leds[i]);

                    uint8_t minutes = clockRTC.getDateTime().hour * 60 + clockRTC.getDateTime().minute;
                    uint8_t minutesOn = leds[i].led.HOn * 60 + leds[i].led.MOn;
                    uint8_t minutesOff = leds[i].led.HOff * 60 + leds[i].led.MOff;
                    if ((minutes > minutesOn) && (minutes < minutesOff)) {
                        ledOnHandler(leds[i]);
                    } else {
                        ledOffHandler(leds[i]);
                    }
                    doc.clear();
                }
            } else {
                Serial.printf_P(PSTR("%s\n"), "Ответ не является JSON объектом");
            }
        } else {
            Serial.printf_P(PSTR("%s: %s\n"), "Ошибка загрузки параметров прожектора", data.errorReason().c_str());
        }
    } else {
        Serial.printf_P(PSTR("%s\n"), "Прожектор не найден");
    }
}
uint16_t ledAddress(const uint8_t num) {
    return StartAddress + num * sizeof(ledDescription);
}
void writeEEPROMLed() {
    uint8_t ledsCount(sizeof(leds) / sizeof(*leds));
    for (size_t i = 0; i < ledsCount; i++) {
        if (eeprom.eeprom_write(ledAddress(i), leds[i])) {
            Serial.printf_P(PSTR(" Параметры по прожектору %s сохранены в EEPROM\n"), leds[i].name.c_str());
        } else {
            Serial.printf_P(PSTR(" Ошибка сохранения параметров прожектора %s в EEPROM\n"), leds[i].name.c_str());
        }
    }
}
void readOptionsEEPROM() {
    ledDescription_t ledFromEEPROM;
    Serial.printf_P(PSTR("%s\n"), "Загрузка настроек из EEPROM");
    uint8_t ledsCount(sizeof(leds) / sizeof(*leds));
    for (size_t i = 0; i < ledsCount; i++) {
        eeprom.eeprom_read(ledAddress(i), &ledFromEEPROM);
        leds[i] = ledFromEEPROM;
        leds[i].led.off = Alarm.alarmRepeat(leds[i].led.HOff, leds[i].led.MOff, 0, ledOffHandler, leds[i]);
        leds[i].led.on = Alarm.alarmRepeat(leds[i].led.HOn, leds[i].led.MOn, 0, ledOnHandler, leds[i]);

        uint8_t minutes = clockRTC.getDateTime().hour * 60 + clockRTC.getDateTime().minute;
        uint8_t minutesOn = leds[i].led.HOn * 60 + leds[i].led.MOn;
        uint8_t minutesOff = leds[i].led.HOff * 60 + leds[i].led.MOff;
        if ((minutes > minutesOn) && (minutes < minutesOff)) {
            ledOnHandler(leds[i]);
        } else {
            ledOffHandler(leds[i]);
        }
    }
    printAllLedsTime();
};
void readOptionsFirebase() {
    Serial.printf_P(PSTR("%s\n"), "Загрузка из Firebase");
    setLEDTime(ONE);
    setLEDTime(TWO);
    setLEDTime(THREE);
    setLEDTime(FOUR);
    setLEDTime(FIVE);
    setLEDTime(SIX);
    Serial.printf_P(PSTR("%s\n"), "Запись в EEPROM");
    writeEEPROMLed();
};
double floatToDouble(float x) {
    return static_cast<double>(x);
}
//Сохранение показаний датчиков температуры
void writeTemperatureFirebase() {
    if (!WiFi.isConnected())
        return;

    char* p1 = clockRTC.dateFormat("Y-m-d", clockRTC.getDateTime());
    String deviceDateKey = p1;
    free(p1);

    FirebaseJson jsonOnline, jsonHistory;
    char* p2 = clockRTC.dateFormat("H:i:s d.m.Y", clockRTC.getDateTime());
    jsonOnline.add("DateTime", String(p2));
    jsonOnline.add("temp1", floatToDouble(temp1));
    jsonOnline.add("temp2", floatToDouble(temp2));
    free(p2);
    char* p3 = clockRTC.dateFormat("H:i:s", clockRTC.getDateTime());
    jsonHistory.add("DateTime", String(p3));
    jsonHistory.add("temp1", floatToDouble(temp1));
    jsonHistory.add("temp2", floatToDouble(temp2));
    free(p3);
    Serial.printf_P(PSTR("%s"), "Отправляем температуру в ветку Online -> ");
    if (Firebase.setJSON(data, pathTemperatureOnline, jsonOnline)) {
        Serial.printf_P(PSTR("%s\n"), "OK");
    } else {
        Serial.printf_P(PSTR("Ошибка: %s\n"), data.errorReason().c_str());
    }
    jsonOnline.clear();

    Serial.printf_P(PSTR("%s"), "Отправляем температуру в ветку History -> ");
    if (Firebase.pushJSON(data, pathTemperatureHistory + deviceDateKey, jsonHistory)) {
        Serial.printf_P(PSTR("%s\n"), "OK");
    } else {
        Serial.printf_P(PSTR("Ошибка: %s\n"), data.errorReason().c_str());
    }
    jsonHistory.clear();
}

void writeBootHistory() {
    char* p = clockRTC.dateFormat("H:i:s d.m.Y", clockRTC.getDateTime());
    if (Firebase.pushString(data, pathToBootHistory, String(p))) {
        Serial.printf_P(PSTR("%s\n"), "Запись времени старта");
    } else {
        Serial.printf_P(PSTR("\n%s %s\n"), "Ошибка записи времени старта:", data.errorReason().c_str());
    }
    free(p);
}
void setClock() {
    configTime(3 * 3600, 0, "pool.ntp.org", "time.nist.gov");
    time_t now = time(nullptr);
    uint8_t tryCount = 0;
    while (now < 8 * 3600 * 2) {
        delay(100);
        now = time(nullptr);
        tryCount++;
        if (tryCount > 50)
            break;
    }
    struct tm timeinfo;
    gmtime_r(&now, &timeinfo);
}
void lastOnline() {
    char* p = clockRTC.dateFormat("H:i:s d.m.Y", clockRTC.getDateTime());
    Firebase.setString(data, pathToLastOnline, String(p));
    free(p);
}
void Timer5Min() {
    uptime();
    lastOnline();
    getTemperature();
    writeTemperatureFirebase();
}

